zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/svd/PIC32CZ2038CA70100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="MCAN0">
         <name>MCAN1</name>
         <baseAddress>0x40034000</baseAddress>
         <interrupt>
            <name>MCAN1</name>
            <value>37</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>MLB</name>
         <version>11287E</version>
         <description>MediaLB</description>
         <groupName>MLB</groupName>
         <prependToName>MLB_</prependToName>
         <baseAddress>0x40068000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x3E0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MLB</name>
            <value>53</value>
         </interrupt>
         <registers>
            <register>
               <name>MLB_MLBC0</name>
               <description>MediaLB Control 0 Register</description>
               <addressOffset>0x000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MLBEN</name>
                     <description>MediaLB Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MLBCLK</name>
                     <description>MLBCLK (MediaLB clock) Speed Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>_256_FS</name>
                           <description>256xFs (for MLBPEN = 0)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_FS</name>
                           <description>512xFs (for MLBPEN = 0)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024_FS</name>
                           <description>1024xFs (for MLBPEN = 0)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ZERO</name>
                     <description>Must be Written to 0</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MLBLK</name>
                     <description>MediaLB Lock Status (read-only)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASYRETRY</name>
                     <description>Asynchronous Tx Packet Retry</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTLRETRY</name>
                     <description>Control Tx Packet Retry</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCNT</name>
                     <description>The number of frames per sub-buffer for synchronous channels</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>_1_FRAME</name>
                           <description>1 frame per sub-buffer (Operation is the same as Standard mode.)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_FRAMES</name>
                           <description>2 frames per sub-buffer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_FRAMES</name>
                           <description>4 frames per sub-buffer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_FRAMES</name>
                           <description>8 frames per sub-buffer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_FRAMES</name>
                           <description>16 frames per sub-buffer</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_FRAMES</name>
                           <description>32 frames per sub-buffer</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_FRAMES</name>
                           <description>64 frames per sub-buffer</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MS0</name>
               <description>MediaLB Channel Status 0 Register</description>
               <addressOffset>0x00C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MCS</name>
                     <description>MediaLB Channel Status [31:0] (cleared by writing a 0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MS1</name>
               <description>MediaLB Channel Status1 Register</description>
               <addressOffset>0x014</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MCS</name>
                     <description>MediaLB Channel Status [63:32] (cleared by writing a 0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MSS</name>
               <description>MediaLB System Status Register</description>
               <addressOffset>0x020</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RSTSYSCMD</name>
                     <description>Reset System Command Detected in the System Quadlet (cleared by writing a 0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LKSYSCMD</name>
                     <description>Network Lock System Command Detected in the System Quadlet (cleared by writing a 0)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULKSYSCMD</name>
                     <description>Network Unlock System Command Detected in the System Quadlet (cleared by writing a 0)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSSYSCMD</name>
                     <description>Channel Scan System Command Detected in the System Quadlet (cleared by writing a 0)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWSYSCMD</name>
                     <description>Software System Command Detected in the System Quadlet (cleared by writing a 0)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERVREQ</name>
                     <description>Service Request Enabled</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MSD</name>
               <description>MediaLB System Data Register</description>
               <addressOffset>0x024</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SD0</name>
                     <description>System Data (Byte 0)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SD1</name>
                     <description>System Data (Byte 1)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SD2</name>
                     <description>System Data (Byte 2)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SD3</name>
                     <description>System Data (Byte 3)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MIEN</name>
               <description>MediaLB Interrupt Enable Register</description>
               <addressOffset>0x02C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ISOC_PE</name>
                     <description>Isochronous Rx Protocol Error Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ISOC_BUFO</name>
                     <description>Isochronous Rx Buffer Overflow Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNC_PE</name>
                     <description>Synchronous Protocol Error Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARX_DONE</name>
                     <description>Asynchronous Rx Done Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARX_PE</name>
                     <description>Asynchronous Rx Protocol Error Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ARX_BREAK</name>
                     <description>Asynchronous Rx Break Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ATX_DONE</name>
                     <description>Asynchronous Tx Packet Done Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ATX_PE</name>
                     <description>Asynchronous Tx Protocol Error Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ATX_BREAK</name>
                     <description>Asynchronous Tx Break Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRX_DONE</name>
                     <description>Control Rx Packet Done Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRX_PE</name>
                     <description>Control Rx Protocol Error Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRX_BREAK</name>
                     <description>Control Rx Break Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTX_DONE</name>
                     <description>Control Tx Packet Done Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTX_PE</name>
                     <description>Control Tx Protocol Error Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTX_BREAK</name>
                     <description>Control Tx Break Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MLBC1</name>
               <description>MediaLB Control 1 Register</description>
               <addressOffset>0x03C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>MediaLB Lock Error Status (cleared by writing a 0)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKM</name>
                     <description>MediaLB Clock Missing Status (cleared by writing a 0)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NDA</name>
                     <description>Node Device Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_HCTL</name>
               <description>HBI Control Register</description>
               <addressOffset>0x080</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RST0</name>
                     <description>Address Generation Unit 0 Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST1</name>
                     <description>Address Generation Unit 1 Software Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>HBI Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>MLB_HCMR</name>
               <description>HBI Channel Mask 0 Register 0</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CHM</name>
                     <description>Bitwise Channel Mask Bit [31:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>MLB_HCER</name>
               <description>HBI Channel Error 0 Register 0</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CERR</name>
                     <description>Bitwise Channel Error Bit [31:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>MLB_HCBR</name>
               <description>HBI Channel Busy 0 Register 0</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CHB</name>
                     <description>Bitwise Channel Busy Bit [31:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>MLB_MDAT</name>
               <description>MIF Data 0 Register 0</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>CRT or DBR Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>MLB_MDWE</name>
               <description>MIF Data Write Enable 0 Register 0</description>
               <addressOffset>0xD0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MASK</name>
                     <description>Bitwise Write Enable for CTR Data - bits[31:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MCTL</name>
               <description>MIF Control Register</description>
               <addressOffset>0x0E0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XCMP</name>
                     <description>Transfer Complete (Write 0 to Clear)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MLB_MADR</name>
               <description>MIF Address Register</description>
               <addressOffset>0x0E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>CTR or DBR Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>TB</name>
                     <description>Target Location Bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTR</name>
                           <description>Selects CTR</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBR</name>
                           <description>Selects DBR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WNR</name>
                     <description>Write-Not-Read Selection</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
